Tekla.Structures.PositionTypeEnum
The position type for connections and details.

Tekla.Structures.PositionTypeEnum.MIDDLE_PLANE
The middle plane position type.

Tekla.Structures.PositionTypeEnum.BOX_PLANE
The box plane position type.

Tekla.Structures.PositionTypeEnum.COLLISION_PLANE
The collision plane position type.

Tekla.Structures.PositionTypeEnum.END_END_PLANE
The end plane position type.

Tekla.Structures.PositionTypeEnum.GUSSET_PLANE
The gusset plane position type.